# 4강 Merge/ Grouping

  ## 1. merge
        1) concat
        2) merge
  ## 2. Grouping

<br><br>

In [116]:
import pandas as pd
data=pd.read_csv('kr_googlestore.csv')

<br><br><br>


---------------------

# 1. merge : 데이터 프레임 병합
    1) concat 
    2) merge

<br><br><br>

## 1) pd.concat : 단순 연결
concat은 연결의 뜻을 가진 concatenation의 줄임말이다. concat은 단순히 하나의 dataframe에 다른 dataframe을 연속적으로 붙여주는 **단순연결**함수다.


즉, 두 dataframe을 행방향(default) or 열방향으로 **단순연결**을 해준다. 

concat을 사용할 때는 열의 이름을 주의하면서 살펴봐야한다. 열의 이름이 같아야지만 합쳐주기 때문이다. 만약  열의 이름이 같지 않다면, concat을 하는데 오류가 생긴다. 

``사용법`` **pd.concat**([데이터프레임, 데이터프레임])

<br><be><br>

##### 데이터프레임 생성
df3만 마지막 컬럼이 다름

In [46]:
df1 = pd.DataFrame({'이름': ['Park', 'James', 'Rai'],
                    '번호': [82, 1, 91],
                    '순서': ['A', 'B', 'C']})

df2 = pd.DataFrame({'이름': ['Leon', 'Nefert', 'lee'],
                    '번호': [49, 20,82 ],
                    '순서': ['D', 'E', 'F']})

df3 = pd.DataFrame({'이름': ['tae', 'young', 'yeoun'],
                    '번호': [82, 82, 82],
                    '나이': [30, 30, 30]})

### concat 사용 

concat은 기본적으로 같은 열의 이름에 맞춰서 세로로 결합이 된다.

``사용법`` **concat**([데이터프레임, 데이터프레임])

In [25]:
pd.concat([df1, df2])

       이름  번호 순서
0    Park  82  A
1   James   1  B
2     Rai  91  C
0    Leon  49  D
1  Nefert  20  E
2     lee  82  F

### concat의 가로 결합 : axis=1


concat은 디폴트 결합은 세로이지만, 가로로 결합하고 싶을 때는 **axis=1** 써주면 된다.

In [30]:
pd.concat([df1,df2],axis=1)

      이름  번호 순서      이름  번호 순서
0   Park  82  A    Leon  49  D
1  James   1  B  Nefert  20  E
2    Rai  91  C     lee  82  F

#### 열의 이름이 다를 때, 생기는 오류.

concat은 열의 이름이 다를 경우 아래와 같은 오류가 발생한다. concat을 사용할 때는 데이터의 열의 이름을 꼭 확인하자.

In [26]:
pd.concat([df1, df3])

C:\Users\park\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

     나이  번호   순서     이름
0   NaN  82    A   Park
1   NaN   1    B  James
2   NaN  91    C    Rai
0  30.0  82  NaN    tae
1  30.0  82  NaN  young
2  30.0  82  NaN  yeoun

<br><br>


------

## 2) join : pd.merge()


두 DataFrame에 공통적으로 포함되어 있는 하나의 열을 기준으로, 해당 열의 값이 동일한 두개의 행들을 하나의 행으로 합치는 방식이다.

하나의 열을 기준으로 사용할 때는 **on='해당 열'** 처럼, on에 특정 열이름을 지정하여 그 열을 기준으로 병합한다. 

SQL의 join함수와 pandas의 merge함수는 사용방법이 비슷하다. 비슷한 점이 많은 merge를 이번 기회에 잘 익혀보자.

``사용법`` pd.merge(데이터프레임, 데이터프레임, **on='해당 열'**)

즉, key 기준으로 DataFrame이 합쳐진다.

<br><br>
-----

#### 데이터프레임 생성

In [62]:
df_left = pd.DataFrame({'이름': ['Park', 'James', 'Rai', 'Leon'],
                        '나이': [27, 60, 41, 39],
                        '번호': [ 1, 2, 3, 4]})

df_right = pd.DataFrame({'이름': ['Park', 'James', 'Rai', 'Leon'],
                         '국적': ['한국', '미국', '인도', '스페인'],
                         '취미': [ '일', '럭비', '유튜브', '요리'],
                         '핸드폰' : ['갤럭시', '블랙베리', '아이폰', '엘지']})

### merge 사용 
``사용법`` pd.merge(데이터프레임, 데이터프레임, **on='해당 열'**)

기준이 되는 열을 **on= '해당 열'** 을 꼭 써주자.

In [63]:
pd.merge(df_left, df_right, on='이름')

      이름  나이  번호   국적   취미   핸드폰
0   Park  27   1   한국    일   갤럭시
1  James  60   2   미국   럭비  블랙베리
2    Rai  41   3   인도  유튜브   아이폰
3   Leon  39   4  스페인   요리    엘지

# 이게 왜 똑같을 까요...?

In [68]:
pd.merge(df_left, df_right, on='이름', how='right')

      이름  나이  번호   국적   취미   핸드폰
0   Park  27   1   한국    일   갤럭시
1  James  60   2   미국   럭비  블랙베리
2    Rai  41   3   인도  유튜브   아이폰
3   Leon  39   4  스페인   요리    엘지

In [65]:
pd.merge(df_left, df_right, on='이름', how='outer')

      이름  나이  번호   국적   취미   핸드폰
0   Park  27   1   한국    일   갤럭시
1  James  60   2   미국   럭비  블랙베리
2    Rai  41   3   인도  유튜브   아이폰
3   Leon  39   4  스페인   요리    엘지

------------------------------
<br><br><br>

## 2. Grouping

group by 함수는 다양한 변수를 가진 데이터셋을 분석하는데 있어 그룹별로 데이터를 집계할 수 있다. 

group by는 값을 하나로 묶어 통계 또는 집계 결과를 얻기 위할 사용된다. 컬럼 별로 평균(mean), 크기(size), 합(sum)을 구할 수 있다.

##### 구글스토어 데이터를 통해 groupby 함수에 대해서 알아보자

In [69]:
data.head()

,어플,장르,등급,리뷰 수,크기,설치 수,타입,가격,연령층,안드로이드 버전,업데이트_년도,업데이트_달,업데이트_년달
0,Photo Editor & Candy Camera & Grid & ScrapBook,Art & Design,4.1,159,190.0,10000,무료,0,전체가,4.0,2018,1,2018.01
1,Coloring book moana,Art & Design;Pretend Play,3.9,967,140.0,500000,무료,0,전체가,4.0,2018,1,2018.01
2,"U Launcher Lite – FREE Live Cool Themes, Hide ...",Art & Design,4.7,87510,8.7,5000000,무료,0,전체가,4.0,2018,8,2018.08
3,Sketch - Draw & Paint,Art & Design,4.5,215644,250.0,50000000,무료,0,청소년,4.2,2018,6,2018.06
4,Pixel Draw - Number Art Coloring Book,Art & Design;Creativity,4.3,967,2.8,100000,무료,0,전체가,4.4,2018,6,2018.06

In [81]:
data.groupby('등급').mean()

,리뷰 수,크기,설치 수,안드로이드 버전,업데이트_년도,업데이트_달,업데이트_년달
등급,,,,,,,
3.2,152.500000,1.900000,5.250000e+04,4.100000,2018.000000,5.000000,2018.050000
3.7,5110.000000,265.000000,1.000000e+06,4.200000,2018.000000,7.000000,2018.070000
3.8,808.000000,192.600000,8.750000e+04,4.075000,2018.000000,5.500000,2018.055000
3.9,856.571429,136.816667,1.242857e+05,3.928571,2018.000000,5.857143,2018.058571
4.0,1178.625000,150.925000,3.562500e+05,3.712500,2017.250000,6.125000,2017.311250
4.1,10702.857143,102.583333,9.085714e+05,3.300000,2017.857143,4.714286,2017.904286
4.2,36367.666667,150.466667,1.724444e+06,4.155556,2017.888889,6.000000,2017.948889
4.3,34893.125000,114.085714,1.550000e+06,3.425000,2018.000000,6.750000,2018.067500
4.4,66644.800000,193.900000,2.610000e+06,3.720000,2017.600000,6.800000,2017.668000
4.5,44040.200000,107.360000,1.006200e+07,3.740000,2017.800000,6.400000,2017.864000
4.6,34021.333333,147.633333,1.594444e+06,4.066667,2018.000000,6.666667,2018.066667
4.7,32126.900000,115.570000,1.757000e+06,4.180000,2017.900000,7.300000,2017.973000
4.8,31233.750000,175.333333,1.402500e+06,3.325000,2018.000000,6.500000,2018.065000
4.9,70333.333333,273.333333,4.000000e+05,4.166667,2018.000000,7.000000,2018.070000

### 등급 크기

In [83]:
data.groupby('등급').size()

등급
3.2     2
3.7     2
3.8     4
3.9     7
4.0     8
4.1     7
4.2     9
4.3     8
4.4     5
4.5     5
4.6     9
4.7    10
4.8     4
4.9     3
dtype: int64

### 특정 컬럼 기준 group by
등급, 어플 컬럼을 기준으로 가격과 연령층을 보여준다

In [122]:
df=data.groupby(['등급', '어플'])['가격', '연령층'].first()

In [123]:
df.head()

                                                    가격  연령층
등급  어플
3.2 Learn To Draw Kawaii Characters                  0  전체가
    RST - Sale of cars on the PCT                    0  전체가
3.7 SKencar                                          0  전체가
    Used car search Goo net whole car Go to net      0  전체가
3.8 How to draw Ladybug and Cat Noir             $1.54  전체가

##### 얘도 안됨.

In [107]:
data.groupby(['등급'])['리뷰 수'].count()

등급
3.2     2
3.7     2
3.8     4
3.9     7
4.0     8
4.1     7
4.2     9
4.3     8
4.4     5
4.5     5
4.6     9
4.7    10
4.8     4
4.9     3
Name: 리뷰 수, dtype: int64

In [115]:
data.groupby(['장르'] == 'Art & Design')

KeyError: False